package com.reyco.dasbx.common.core.constant;

import java.util.ArrayList;
import java.util.LinkedList;

public class Constants {
	
	public final static String PERSONAGE_INDEX_NAME = "personage";
	public final static String PERSONAGE_SEARCH_FIELD = "all";
	public final static String[] PERSONAGE_SEARCH_MULTIFIELDS = new String[] {"name","code","masterpiece"};
	public final static String[] PERSONAGE_HIGHLIGHT_FIELDS = new String[] {"name","code","masterpiece"};
	public final static String PERSONAGE_suggestion_NAME = "suggestion";
	public final static String PERSONAGE_SUGGESTION_FIELD = "suggestion";
	public final static String[] PERSONAGE_AGGREGATION_FIELDS = new String[] {"gender","masterpiece"};
	public final static String[] PERSONAGE_AGGREGATION_NAMES = new String[] {};
	public final static Integer[] PERSONAGE_AGGREGATION_SIZES = new Integer[] {};
	public final static Boolean[] PERSONAGE_AGGREGATION_FIELD_ORDERS = new Boolean[] {};
	
	/**
	 * 明星人物
	 */
	public static final LinkedList<String> PERSONAGE = new LinkedList<String>(){/**
		 * 
		 */
		private static final long serialVersionUID = -4764900497915537125L;

	{
		//10
		add("天龙八部|女|阿朱");add("天龙八部|女|阿紫");add("天龙八部|女|王语嫣");add("天龙八部|女|木婉清");add("天龙八部|女|阿碧");
		add("天龙八部|女|叶二娘");add("天龙八部|女|李秋水");add("天龙八部|女|天山童姥");add("天龙八部|女|梦姑");add("天龙八部|女|钟灵");
		//17
		add("天龙八部|男|乔峰");add("天龙八部|男|段誉");add("天龙八部|男|虚竹");add("天龙八部|男|慕容复");add("天龙八部|男|鸠摩智");
		add("天龙八部|男|游坦之");add("天龙八部|男|丁春秋");add("天龙八部|男|段延庆");add("天龙八部|男|玄慈");add("天龙八部|男|云中鹤");
		add("天龙八部|男|苏星河");add("天龙八部|男|扫地僧");add("天龙八部|男|阮星竹");add("天龙八部|男|段正淳");add("天龙八部|男|孟襄江");
		add("天龙八部|男|萧远山");add("天龙八部|男|慕容博");
		//10
		add("射雕英雄传|女|黄蓉");add("射雕英雄传|女|李萍");add("射雕英雄传|女|包惜弱");add("射雕英雄传|女|梅超风");add("射雕英雄传|女|穆念慈");
		add("射雕英雄传|女|韩小莹");add("射雕英雄传|女|瑛姑");add("射雕英雄传|女|傻姑");add("射雕英雄传|女|华筝");add("射雕英雄传|女|冯蘅");
		//20
		add("射雕英雄传|男|王重阳");add("射雕英雄传|男|周伯通");add("射雕英雄传|男|黄药师");add("射雕英雄传|男|欧阳锋");add("射雕英雄传|男|洪七公");
		add("射雕英雄传|男|黄裳");add("射雕英雄传|男|郭靖");add("射雕英雄传|男|段王爷");add("射雕英雄传|男|杨康");add("射雕英雄传|男|段智兴");
		add("射雕英雄传|男|欧阳克");add("射雕英雄传|男|柯镇恶");add("射雕英雄传|男|铁木真");add("射雕英雄传|男|郭啸天");add("射雕英雄传|男|杨铁心");
		add("射雕英雄传|男|曲灵风");add("射雕英雄传|男|陈玄风");add("射雕英雄传|男|陆乘风");add("射雕英雄传|男|武眠风");add("射雕英雄传|男|冯默风");
		//10
		add("神雕侠侣|女|小龙女");add("神雕侠侣|女|郭芙");add("神雕侠侣|女|李莫愁");add("神雕侠侣|女|陆无双");add("神雕侠侣|女|程英");
		add("神雕侠侣|女|郭襄");add("神雕侠侣|女|公孙绿萼");add("神雕侠侣|女|曲傻姑");add("神雕侠侣|女|耶律燕");add("神雕侠侣|女|林朝英");
		//15
		add("神雕侠侣|男|杨过");add("神雕侠侣|男|金轮法王");add("神雕侠侣|男|耶律齐");add("神雕侠侣|男|天竺僧");add("神雕侠侣|男|马钰");
		add("神雕侠侣|男|郭破虏");add("神雕侠侣|男|裘千尺");add("神雕侠侣|男|狗头陀");add("神雕侠侣|男|忽必烈");add("神雕侠侣|男|沙通天");
		add("神雕侠侣|男|大头鬼");add("神雕侠侣|男|丘处机");add("神雕侠侣|男|赵志敬");add("神雕侠侣|男|鲁有脚");add("神雕侠侣|男|裘千仞");
		//15
		add("倚天屠龙记|女|赵敏");add("倚天屠龙记|女|周芷若");add("倚天屠龙记|女|小昭");add("倚天屠龙记|女|殷离");add("倚天屠龙记|女|丁敏君");
		add("倚天屠龙记|女|殷素素");add("倚天屠龙记|女|纪晓芙");add("倚天屠龙记|女|黛绮丝");add("倚天屠龙记|女|灭绝师太");add("倚天屠龙记|女|武青婴");
		add("倚天屠龙记|女|杨不悔");add("倚天屠龙记|女|韩姬");add("倚天屠龙记|女|黄衫女子");add("倚天屠龙记|女|朱九真");
		//25
		add("倚天屠龙记|男|张无忌");add("倚天屠龙记|男|杨逍");add("倚天屠龙记|男|阳顶天");add("倚天屠龙记|男|成昆");add("倚天屠龙记|男|宋青书");
		add("倚天屠龙记|男|谢逊");add("倚天屠龙记|男|张三丰");add("倚天屠龙记|男|殷天正");add("倚天屠龙记|男|殷野王");add("倚天屠龙记|男|范遥");
		add("倚天屠龙记|男|说不得");add("倚天屠龙记|男|周颠");add("倚天屠龙记|男|鲜于通");add("倚天屠龙记|男|玄冥二老");add("倚天屠龙记|男|宋远桥");
		add("倚天屠龙记|男|俞莲舟");add("倚天屠龙记|男|张翠山");add("倚天屠龙记|男|俞岱岩");add("倚天屠龙记|男|张松溪");add("倚天屠龙记|男|殷梨亭");
		add("倚天屠龙记|男|莫声谷");
		//10
		add("风云|女|孔慈");add("风云|女|于楚楚");add("风云|女|第二梦");add("风云|女|明月");add("风云|女|幽若");
		add("风云|女|独孤梦");add("风云|女|丁宁");add("风云|女|颜盈");add("风云|女Ⅱ|骆仙");add("风云|女Ⅱ|紫凝");
		//35
		add("风云|男|步惊云");add("风云|男|聂风");add("风云|男|秦双");add("风云|男|断浪");add("风云|男|绝心");
		add("风云|男|绝天");add("风云|男|无名");add("风云|男|剑晨");add("风云|男|聂人王");add("风云|男|聂英");
		add("风云|男|雄霸");add("风云|男|剑圣");add("风云|男|破 军");add("风云|男|绝无神");add("风云|男|泥菩萨");
		add("风云|男|文丑丑");add("风云|男|独孤一方");add("风云|男|雪暗天");add("风云|男|于岳");add("风云|男|捕神");
		add("风云|男|傲天");add("风云|男|钟眉");add("风云|男|剑贫");add("风云|男|温弩");add("风云|男|食为仙");
		add("风云|男|纸探花");add("风云|男|第三猪皇");add("风云|男|第二刀皇");add("风云|男|第一邪皇");add("风云Ⅱ|男|帝释天");
		add("风云Ⅱ|男|怀空");add("风云Ⅱ|男|怀灭");add("风云Ⅱ|男|笑三笑");add("风云Ⅱ|男|铁狂屠");add("风云Ⅱ|男|步天");
		//1
		add("三少爷的剑|女|慕容秋荻");
		//5
		add("三少爷的剑|男|燕十三");add("三少爷的剑|男|谢晓峰");add("三少爷的剑|男|竹叶青");add("三少爷的剑|男|谢王孙");
		//3
		add("东方不败|女|东方不败");add("东方不败|女|任盈盈");add("东方不败|女|蓝凤凰");
		//3
		add("东方不败|男|令狐冲");add("东方不败|男|任我行");add("东方不败|男|风清扬");
		//5
		add("陆小凤传|男奇|叶孤城");add("陆小凤传|男奇|西门吹雪");add("陆小凤传|男奇|花满楼");add("陆小凤传|男奇|陆小凤");add("陆小凤传|男奇|司空摘星");
		//60
		add("香港演员|女|梅艳芳");add("香港演员|女|张曼玉");add("香港演员|女|李嘉欣");add("香港演员|女|杨恭如");
		add("香港演员|女|朱茵");add("香港演员|女|蒙嘉慧");add("香港演员|女|佘诗曼");add("香港演员|女|胡慧中");
		add("香港演员|女|刘嘉玲");add("香港演员|女|吴君如");add("香港演员|女|蔡少芬");add("香港演员|女|杨紫琼");
		add("香港演员|女|林青霞");add("香港演员|女|陈怡蓉");add("香港演员|女|陈淑萍");add("香港演员|女|陈慧娴");
		add("香港演员|女|周海媚");add("香港演员|女|陈法蓉");add("香港演员|女|赵雅芝");add("香港演员|女|邱淑贞");
		add("香港演员|女|李丽珍");add("香港演员|女|陈德容");add("香港演员|女|关之琳");add("香港演员|女|叶子媚");
		add("香港演员|女|蓝洁瑛");add("香港演员|女|周慧敏");add("香港演员|女|梁咏琪");add("香港演员|女|李若彤");
		add("香港演员|女|翁虹");add("香港演员|女|袁咏仪");add("香港演员|女|万绮雯");add("香港演员|女|钟楚红");
		add("香港演员|女|薛凯琪");add("香港演员|女|莫文蔚");add("香港演员|女|翁美玲");add("香港演员|女|温碧霞");
		add("香港演员|女|范琼丹");add("香港演员|女|罗慧娟");add("香港演员|女|容祖儿");add("香港演员|女|郑秀文");
		add("香港演员|女|陈美琪");add("香港演员|女|张钧甯");add("香港演员|女|张敏");add("香港演员|女|黎姿");
		//55
		add("香港演员|男|张国荣");add("香港演员|男|周星驰");add("香港演员|男|王杰");add("香港演员|男|周润发");add("香港演员|男|成龙");
		add("香港演员|男|黄家驹");add("香港演员|男|谢霆锋");add("香港演员|男|林正英");add("香港演员|男|古天乐");add("香港演员|男|张学友");
		add("香港演员|男|郭富城");add("香港演员|男|洪金宝");add("香港演员|男|张智霖");add("香港演员|男|郑伊健");add("香港演员|男|张家辉");
		add("香港演员|男|陈浩民");add("香港演员|男|王晶");add("香港演员|男|郑少秋");add("香港演员|男|陈百强");add("香港演员|男|黄秋生");
		add("香港演员|男|林子祥");add("香港演员|男|任达华");add("香港演员|男|谭咏麟");add("香港演员|男|梁家辉");add("香港演员|男|吴镇宇");
		add("香港演员|男|曾志伟");add("香港演员|男|钱小豪");add("香港演员|男|钱嘉乐");add("香港演员|男|孙耀威");add("香港演员|男|张耀扬");
		add("香港演员|男|刘青云");add("香港演员|男|欧阳震华");add("香港演员|男|元彪");add("香港演员|男|陈百祥");add("香港演员|男|郭晋安");
		add("香港演员|男|成奎安");add("香港演员|男|曹查理");add("香港演员|男|谢君豪");add("香港演员|男|元华");add("香港演员|男|吴启华");
		add("香港演员|男|林家栋");add("香港演员|男|李子雄");add("香港演员|男|廖启智");add("香港演员|男|王喜");add("香港演员|男|林国栋");
		add("香港演员|男|卢冠廷");add("香港演员|男|黄光亮");add("香港演员|男|袁祥仁");add("香港演员|男|田启文");add("香港演员|男|钟发");
		add("内地演员|男|何润东");add("内地演员|男|胡歌");add("内地演员|男|霍建华");add("内地演员|男|吴京");add("内地演员|男|李连杰");
	}};
	public static final ArrayList<String> MASTERPIECE = new ArrayList<String>() {/**
		 * 
		 */
		private static final long serialVersionUID = 2315199695311133260L;
	{
		add("香港演员");add("澳门演员");add("台湾演员");add("大陆演员");add("群众演员");
	}}; 
	/**
	 * 百家姓
	 */
	/*public static final LinkedList<String> SURNAME = new LinkedList<String>(){{
		SURNAME.add("赵钱孙李周吴郑王");SURNAME.add("冯陈褚卫蒋沈韩杨");SURNAME.add("朱秦尤许何吕施张408");
		SURNAME.add("孔曹严华金魏陶姜");SURNAME.add("戚谢邹喻柏水窦章");SURNAME.add("云苏潘葛奚范彭郎");
		SURNAME.add("鲁韦昌马苗凤花方");SURNAME.add("俞任袁柳酆鲍史唐");SURNAME.add("费廉岑薛雷贺倪汤");
		SURNAME.add("滕殷罗毕郝邬安常");SURNAME.add("乐于时傅皮卞齐康");SURNAME.add("伍余元卜顾孟平黄");
		SURNAME.add("和穆萧尹姚邵湛汪");SURNAME.add("祁毛禹狄米贝明臧");SURNAME.add("计伏成戴谈宋茅庞");
		SURNAME.add("熊纪舒屈项祝董梁");SURNAME.add("杜阮蓝闵席季麻强");SURNAME.add("贾路娄危江童颜郭");
		SURNAME.add("梅盛林刁钟徐邱骆");SURNAME.add("高夏蔡田樊胡凌霍");SURNAME.add("虞万支柯昝管卢莫");
		SURNAME.add("经房裘缪干解应宗");SURNAME.add("丁宣贲邓郁单杭洪");SURNAME.add("包诸左石崔吉钮龚");
		SURNAME.add("程嵇邢滑裴陆荣翁");SURNAME.add("荀羊於惠甄曲家封");SURNAME.add("芮羿储靳汲邴糜松");
		SURNAME.add("井段富巫乌焦巴弓");SURNAME.add("牧隗山谷车侯宓蓬");SURNAME.add("全郗班仰秋仲伊宫");
		SURNAME.add("宁仇栾暴甘钭厉戎");SURNAME.add("祖武符刘景詹束龙");SURNAME.add("叶幸司韶郜黎蓟薄");
		SURNAME.add("印宿白怀蒲邰从鄂");SURNAME.add("索咸籍赖卓蔺屠蒙");SURNAME.add("池乔阴鬱胥能苍双");
		SURNAME.add("闻莘党翟谭贡劳逄");SURNAME.add("姬申扶堵冉宰郦雍");SURNAME.add("郤璩桑桂濮牛寿通");
		SURNAME.add("边扈燕冀郏浦尚农");SURNAME.add("温别庄晏柴瞿阎充");SURNAME.add("慕连茹习宦艾鱼容");
		SURNAME.add("向古易慎戈廖庾终");SURNAME.add("暨居衡步都耿满弘");SURNAME.add("匡国文寇广禄阙东");
		SURNAME.add("欧殳沃利蔚越夔隆");SURNAME.add("师巩厍聂晁勾敖融");SURNAME.add("冷訾辛阚那简饶空");
		SURNAME.add("曾毋沙乜养鞠须丰");SURNAME.add("巢关蒯相查后荆红");SURNAME.add("游竺权逯盖益桓公");
		SURNAME.add("万俟");SURNAME.add("司马");SURNAME.add("上官");SURNAME.add("欧阳");
		SURNAME.add("夏侯");SURNAME.add("诸葛");SURNAME.add("闻人");SURNAME.add("东方");
		SURNAME.add("赫连");SURNAME.add("皇甫");SURNAME.add("尉迟");SURNAME.add("公羊");
		SURNAME.add("澹台");SURNAME.add("宗政");SURNAME.add("濮阳");SURNAME.add("淳于");
		SURNAME.add("单于");SURNAME.add("太叔");SURNAME.add("申屠");SURNAME.add("公孙");
		SURNAME.add("仲孙");SURNAME.add("轩辕");SURNAME.add("令狐");SURNAME.add("钟离");
		SURNAME.add("宇文");SURNAME.add("长孙");SURNAME.add("慕容");SURNAME.add("鲜于");
		SURNAME.add("闾丘");SURNAME.add("司徒");SURNAME.add("司空");
		SURNAME.add("丌官 司寇 仉督 子车");SURNAME.add("颛孙 端木 巫马 公西");SURNAME.add("漆雕 乐正 壤驷 公良");
		SURNAME.add("拓跋 夹谷 宰父 谷梁");SURNAME.add("晋楚 闫法 汝鄢 涂钦");SURNAME.add("段干 百里 东郭 南门");
		SURNAME.add("呼延 归海 羊舌 微生");SURNAME.add("岳帅 缑亢 况郈 有琴");SURNAME.add("梁丘 左丘 东门 西门");
		SURNAME.add("商牟 佘佴 伯赏 南宫");SURNAME.add("墨哈 谯笪 年爱  阳  佟");SURNAME.add("第五  言  福");
	}};*/
	//男名字
	/*public final static String man_name_1 = "如奕，铭天，炜钧，宏振，泰玮，权立，季瑞，悦东，梦俊，康鸣，宁菡，峪嘉，昱韦，祥毅，坤轩，才苑，鼎元，志绍，涵翎，睿晨，"
			+ "俊成，志耀，兴彬，纶济，翰秋，宣祁，柯德，自玉，帆荣，皓雅，俊盈，博俊，翰博，奇冠，翎逸，雅轩，成盈，忆胜，温舒，俊济，"
			+ "宁韦，峪轩，昱坤，祥毅，嘉菡，长泽，宇天，厚鹏，鸣俊，翰昌，楠弘，俊弘，棋昊，德涛，昌思，文凯，智波，瀚翰，鑫达，尚安，"
			+ "轩吟，诚天，飞俊，锦嘉，伟康，国玮，鸿轩，葵玮，月泽，华韵，忠欧，锐水，翰桓，鹏熠，宁硕，臻德，凯星，黎温，承典，白良，"
			+ "宣玉，柯雅，自皓，帆荣，德祁，亦珅，冉呈，恩琦，晨思，林益，文翰，智安，瀚尚，鑫达，波凯，亦琦，冉益，恩林，晨思，呈珅，"
			+ "瀚予，敬慎，昊空，景希，诩渤，安民，安宁，安邦，安福，安歌，安国，安和，安康，安澜，安平，安然，安顺，安翔，安晏，安宜，"
			+ "安怡，安易，安志，昂然，昂雄，昂杰，昂熙，波涛，博瀚，博超，博达，博厚，博简，博明，博容，博赡，博涉，博实，博涛，宾白，"
			+ "宾鸿，宾实，彬彬，彬炳，彬郁，斌斌，斌蔚，滨海，波光，波鸿，波峻，博文，博学，博雅，博延，博艺，博易，博裕，博远，才捷，"
			+ "才良，才艺，才英，才哲，才俊，成和，成弘，成化，成济，成礼，成龙，成仁，成双，成天，成业，成益，成荫，成周，承安，承弼，"
			+ "承德，承恩，承福，承基，承教，承平，承嗣，承天，承望，承宣，承颜，承业，承悦，承允，承运，承载，承泽，承志，昌勋，昌盛，"
			
			+ "昌淼，昌茂，昌黎，昌燎，昌翰，德惠，德容，德本，德海，德厚，德华，德辉，德润，德寿，德水，德馨，德曜，德业，德义，德庸，"
			+ "德佑，德宇，德元，德运，德泽，德明，德昌，德曜，飞昂，飞白，飞飙，飞掣，飞尘，飞沉，飞驰，飞光，飞翰，飞航，飞翮，飞鸿，"
			+ "飞虎，飞捷，飞龙，飞鸾，飞鸣，飞鹏，飞扬，飞文，飞翔，飞星，飞翼，飞英，飞宇，飞羽，飞雨，飞语，飞跃，飞章，飞舟，风华，"
			+ "丰茂，丰羽，刚豪，刚洁，刚捷，刚毅，高昂，高岑，高畅，高超，高驰，高达，高澹，高飞，高芬，高峯，高歌，高格，高寒，高翰，"
			+ "高杰，高洁，高峻，高朗，高丽，高邈，高旻，高明，高爽，高兴，高轩，高雅，高扬，高阳，高义，高谊，高逸，高懿，高原，高远，"
			+ "高韵，高卓，光赫，光华，光辉，光济，光霁，光亮，光临，光明，光启，光熙，光耀，光誉，光远，国安，国兴，国源，冠宇，冠玉，"
			+ "晗昱，晗日，涵畅，涵涤，涵亮，涵忍，涵容，涵润，涵涵，涵煦，涵蓄，涵衍，涵意，涵映，涵育，翰采，翰池，翰飞，翰海，翰翮，"
			+ "翰林，翰墨，翰学，翰音，瀚玥，翰藻，瀚海，瀚漠，昊苍，昊昊，昊空，昊乾，昊穹，昊然，昊然，昊天，昊焱，昊英，浩波，浩博，"
			+ "浩初，浩大，浩宕，浩荡，浩歌，浩广，浩涆，浩瀚，弘伟，弘文，弘新，弘雅，弘扬，弘业，弘义，弘益，弘毅，弘懿，弘致，弘壮"
			+ "宏伯，宏博，宏才，宏畅，宏达，宏大，宏放，宏富，宏峻，宏浚，宏恺，宏旷，宏阔，宏朗，宏茂，宏邈，宏儒，宏深，宏胜，宏盛，"
			
			+ "宏爽，宏硕，宏伟，宏扬，宏义，宏逸，宏毅，宏远，宏壮，鸿宝，鸿波，鸿博，鸿才，鸿彩，鸿畅，鸿畴，鸿达，鸿德，鸿飞，鸿风，"
			+ "鸿福，鸿光，鸿晖，鸿朗，鸿文，鸿熙，鸿羲，鸿禧，浩浩，浩慨，浩旷，浩阔，浩漫，浩淼，浩渺，浩邈，浩气，浩然，浩穰，浩壤，"
			+ "浩思，浩言，皓轩，和蔼，和安，和璧，和昶，和畅，和风，和歌，和光，和平，和洽，和惬，和顺，和硕，和颂，和泰，和悌，和通，"
			+ "和同，和煦，和雅，和宜，和怡，和玉，和裕，和豫，和悦，和韵，和泽，和正，和志，鹤轩，弘博，弘大，弘方，弘光，弘和，弘厚，"
			+ "弘化，弘济，弘阔，弘亮，弘量，弘深，弘盛，弘图，鸿信，鸿轩，鸿煊，鸿煊，鸿雪，鸿羽，鸿远，鸿云，鸿运，鸿哲，鸿祯，鸿振，"
			+ "鸿志，鸿卓，华奥，华采，华彩，华灿，华藏，华池，华翰，华皓，华晖，华辉，华茂，华美，华清，华荣，华容，嘉赐，嘉德，嘉福，"
			+ "嘉良，嘉茂，嘉木，嘉慕，嘉纳，嘉年，嘉平，嘉庆，嘉荣，嘉容，嘉瑞，嘉胜，嘉石，嘉实，嘉树，嘉澍，嘉熙，嘉禧，嘉祥，嘉歆，"
			+ "嘉许，嘉勋，嘉言，嘉谊，嘉懿，嘉颖，嘉佑，嘉玉，嘉誉，嘉悦，嘉运，嘉泽，嘉珍，嘉祯，嘉志，嘉致，坚白，坚壁，坚秉，坚成，"
			+ "坚诚，建安，建白，建柏，建本，建弼，建德，建华，建明，建茗，建木，建树，建同，建修，建业，建义，建元，建章，建中，健柏，"
			+ "金鑫，锦程，瑾瑜，晋鹏，经赋，经亘，经国，经略，经纶，经纬，经武，经业，经义，经艺，景澄，景福，景焕，景辉，景辉，景龙，"
			
			+ "景明，景山，景胜，景铄，景天，景同，景曜，靖琪，君昊，君浩，俊艾，俊拔，俊弼，俊才，俊材，俊驰，俊楚，俊达，俊德，俊发，"
			+ "俊风，俊豪，俊健，俊杰，俊捷，俊郎，俊力，俊良，俊迈，俊茂，俊美，俊民，俊名，俊明，俊楠，俊能，俊人，俊爽，俊悟，俊晤，"
			+ "俊侠，俊贤，俊雄，俊雅，俊彦，俊逸，俊英，俊友，俊语，俊誉，俊远，俊哲，俊喆，俊智，峻熙，季萌，季同，开畅，开诚，开宇，"
			+ "开济，开霁，开朗，凯安，凯唱，凯定，凯风，凯复，凯歌，凯捷，凯凯，凯康，凯乐，凯旋，凯泽，恺歌，恺乐，康安，康伯，康成，"
			+ "康德，康复，康健，康乐，康宁，康平，康胜，康盛，康时，康适，康顺，康泰，康裕，乐安，乐邦，乐成，乐池，乐和，乐家，乐康，"
			+ "乐人，乐容，乐山，乐生，乐圣，乐水，乐天，乐童，乐贤，乐心，乐欣，乐逸，乐意，乐音，乐咏，乐游，乐语，乐悦，乐湛，乐章，"
			+ "乐正，乐志，黎昕，黎明，力夫，力强，力勤，力行，力学，力言，立诚，立果，立人，立辉，立轩，立群，良奥，良弼，良才，良材，"
			+ "良策，良畴，良工，良翰，良吉，良骥，良俊，良骏，良朋，良平，良哲，理群，理全，茂才，茂材，茂德，茂典，茂实，茂学，茂勋，"
			+ "茂彦，敏博，敏才，敏达，敏叡，敏学，敏智，明诚，明达，明德，明辉，明杰，明俊，明朗，明亮，明旭，明煦，明轩，明远，明哲，"
			+ "明喆，明知，明志，明智，明珠，朋兴，朋义，彭勃，彭薄，彭彭，彭魄，彭越，彭泽，彭祖，鹏程，鹏池，鹏飞，鹏赋，鹏海，鹏鲸，"
			
			+ "鹏举，鹏鹍，鹏鲲，鹏涛，鹏天，鹏翼，鹏云，鹏运，濮存，溥心，璞玉，璞瑜，浦和，浦泽，奇略，奇迈，奇胜，奇水，奇思，奇邃，"
			+ "奇伟，奇玮，奇文，奇希，奇逸，奇正，奇志，奇致，祺福，祺然，祺祥，祺瑞，琪睿，庆生，荣轩，锐达，锐锋，锐翰，锐进，锐精，"
			+ "锐立，锐利，锐思，锐逸，锐意，锐藻，锐泽，锐阵，锐志，锐智，睿博，睿才，睿诚，睿慈，睿聪，睿达，睿德，睿范，睿广，睿好，"
			+ "睿明，睿识，睿思，绍辉，绍钧，绍祺，绍元，升荣，圣杰，晟睿，思聪，思淼，思源，思远，思博，斯年，斯伯，泰初，泰和，泰河，"
			+ "泰鸿，泰华，泰宁，泰平，泰清，泰然，天材，天成，天赋，天干，天罡，天工，天翰，天和，天华，天骄，天空，天禄，天路，天瑞，"
			+ "天睿，天逸，天佑，天宇，天元，天韵，天泽，天纵，同方，同甫，同光，同和，同化，同济，巍昂，巍然，巍奕，伟博，伟毅，伟才，"
			+ "伟诚，伟茂，伟懋，伟祺，伟彦，伟晔，伟泽，伟兆，伟志，温纶，温茂，温书，温韦，温文，温瑜，文柏，文昌，文成，文德，文栋，"
			+ "文赋，文光，文翰，文虹，文华，文康，文乐，文林，文敏，文瑞，文山，文石，文星，文轩，文宣，文彦，文曜，文耀，文斌，文彬，"
			+ "文滨，向晨，向笛，向文，向明，向荣，向阳，翔宇，翔飞，项禹，项明，晓博，心水，心思，心远，欣德，欣嘉，欣可，欣然，欣荣，"
			+ "欣怡，欣怿，欣悦，新翰，新霁，新觉，新立，新荣，新知，信鸿，信厚，信鸥，信然，信瑞，兴安，兴邦，兴昌，兴朝，兴德，兴发，"
			
			+ "兴国，兴怀，兴平，兴庆，兴生，兴思，兴腾，兴旺，兴为，兴文，兴贤，兴修，兴学，兴言，兴业，兴运，星波，星辰，星驰，星光，"
			+ "星海，星汉，星河，星华，星晖，星火，星剑，星津，星阑，星纬，星文，星宇，星雨，星渊，星洲，修诚，修德，修杰，修洁，修谨，"
			+ "修筠，修明，修能，修平，修齐，修然，修为，修伟，修文，修雅，修永，修远，修真，修竹，修贤，旭尧，炫明，学博，学海，学林，"
			+ "学民，学名，学文，学义，学真，雪松，雪峰，雪风，雅昶，雅畅，雅达，雅惠，雅健，雅珺，雅逸，雅懿，雅志，炎彬，阳飙，阳飇，"
			+ "阳冰，阳波，阳伯，阳成，阳德，阳华，阳晖，阳辉，阳嘉，阳平，阳秋，阳荣，阳舒，阳朔，阳文，阳曦，阳夏，阳旭，阳煦，阳炎，"
			+ "阳焱，阳曜，阳羽，阳云，阳泽，阳州，烨赫，烨华，烨磊，烨霖，烨然，烨烁，烨伟，烨烨，烨熠，烨煜，毅然，逸仙，逸明，逸春，"
			+ "宜春，宜民，宜年，宜然，宜人，宜修，意远，意蕴，意致，意智，熠彤，懿轩，英飙，英博，英才，英达，英发，英范，英光，英豪，"
			+ "英华，英杰，英朗，英锐，英睿，英叡，英韶，英卫，英武，英悟，英勋，英彦，英耀，英奕，英逸，英毅，英哲，英喆，英卓，英资，"
			+ "英纵，永怡，永春，永安，永昌，永长，永丰，永福，永嘉，永康，永年，永宁，永寿，永思，永望，永新，永言，永逸，永元，永贞，"
			+ "咏德，咏歌，咏思，咏志，勇男，勇军，勇捷，勇锐，勇毅，宇达，宇航，宇寰，宇文，宇荫，雨伯，雨华，雨石，雨信，雨星，雨泽，"
			
			+ "玉宸，玉成，玉龙，玉泉，玉山，玉石，玉书，玉树，玉堂，玉轩，玉宇，玉韵，玉泽，煜祺，元白，元德，元化，元基，元嘉，元甲，"
			+ "元驹，元凯，元恺，元魁，元良，元亮，元龙，元明，元青，元思，元纬，元武，元勋，元正，元忠，元洲，远航，苑博，苑杰，越彬，"
			+ "蕴涵，蕴和，蕴藉，展鹏，哲瀚，哲茂，哲圣，哲彦，振海，振国，正诚，正初，正德，正浩，正豪，正平，正奇，正青，正卿，正文，"
			+ "正祥，正信，正雅，正阳，正业，正谊，正真，正志，志诚，志新，志勇，志明，志国，志强，志尚，志专，志文，志行，志学，志业，"
			+ "志义，志用，志泽，致远，智明，智鑫，智勇，智敏，智志，智渊，子安，子晋，子民，子明，子默，子墨，子平，子琪，子石，子实，"
			+ "子真，子濯，子昂，子轩，子瑜，自明，自强，作人，自怡，自珍，曾琪，泽宇，泽语";*/
	/**
	 * 女名字
	 */
	/*public final static String gril_name_1 ="安卉，安娜，安安，荌荌，安妮，安然，傲冬，傲晴，傲雪，白雪，白云，碧螺，碧菡，碧玉，冰蓝，冰冰，采绿，采文，采萱，初雪，"
			+ "春华，春雪，丹丹，丹彤，丹红，冬雪，芳馥，芳懿，芳芳，方方，芳菲，芳华，芳馨，芳泽，芳茵，芳蕙，芳春，芳洲，芳蕤，芳润，"
			+ "芳荃，芳林，芳苓，芳洁，芳蔼，飞双，飞雪，飞烟，飞燕，飞英，谷雪，古兰，古韵，古香，歌阑，歌吹，歌韵，歌飞，格菲，葛菲，"
			+ "戈雅，格格，含烟，含玉，涵菡，晗蕾，涵韵，晗玥，寒凝，寒香，寒雁，和悌，和美，和怡，红螺，虹雨，虹彩，虹英，虹颖，虹影，"
			+ "怀玉，慧心，慧颖，慧雅，慧智，慧美，和雅，和璧，和玉，和暖，红叶，红豆，红雪，红英，红云，红旭，红香，红艳，慧捷，慧丽，"
			+ "慧月，慧云，慧俊，慧秀，慧巧，慧英，慧艳，浩岚，家美，家欣，家馨，佳悦，嘉怡，嘉宝，嘉惠，嘉悦，嘉歆，嘉美，嘉云，嘉玉，"
			+ "嘉丽，嘉淑，嘉怡，嘉懿，洁玉，晶滢，晶辉，静曼，静涵，静逸，静姝，静娴，静婉，静雅，静慧，静云，静安，静秀，娟秀，娟妍，"
			+ "娟丽，娟巧，兰若，兰蕙，兰梦，兰泽，兰芝，兰英，兰娜，岚霏，岚翠，岚彩，乐安，乐心，乐悦，乐容，乐英，丽泽，丽华，丽雅，"
			+ "丽芳，丽佳，丽姿，丽珠，丽容，丽文，灵秀，灵韵，灵慧，灵卉，灵萱，玲玲，玲珑，凌波，凌春，凌霜，凌雪，莉莉，曼蔓，曼冬，"
			+ "曼青，曼容，曼文，曼妮，曼云，曼衍，曼丽，曼语，曼辞，曼珠，曼音，曼吟，美丽，美华，米琪，梦凡，梦菲，梦菡，梦露，梦琪，"
			
			+ "梦秋，梦竹，妙晴，玛丽，茉莉，麦冬，念文，凝雪，娜兰，妮娜，纳兰，沛珊，沛文，萍韵，萍雅，绮玉，清雅，清逸，清华，清秋，"
			+ "清馨，清心，清韵，清芬，清涵，清妍，清昶，清怡，清婉，清晖，清绮，清漪，清卓，清懿，清润，清俊，清宁，清淑，清舒，清霁，"
			+ "清佳，清妙，庆雪，晴岚，晴雪，晴虹，晴波，晴霞，晴丽，晴照，晴画，蓉蓉，融雪，如风，如云，若云，若兰，诗兰，诗蕾，诗蕊，"
			+ "书萱，淑兰，舒兰，舒云，舒方，淑华，思美，思云，施诗，天韵，天心，天蓝，听云，甜恬，恬美，恬然，恬静，婷美，婷秀，宛白，"
			+ "琬凝，婉然，婉仪，婉静，婉慧，婉丽，婉容，婉秀，婉清，婉娜，雯丽，雯华，文茵，文静，文君，文漪，文丽，文心，文惠，文敏，"
			+ "玟丽，玟玉，问筠，问萍，惜文，惜雪，惜玉，夏菡，夏兰，夏岚，夏青，夏彤，夏旋，霞绮，霞飞，霞辉，霞姝，霞月，霞英，霞雰，"
			+ "霞影，霞赩，霞文，湘云，香馨，向卉，向彤，向雪，晓燕，晓莉，晓凡，晓兰，晓曼，晓霜，笑寒，心语，心香，心愫，心宜，心怡，"
			+ "心诺，心远，新梅，欣美，欣然，欣悦，欣欣，欣嘉，欣荣，欣愉，欣可，欣畅，欣跃，欣合，欣笑，欣艳，新蕾，新雪，新月，馨香，"
			+ "馨逸，馨荣，馨兰，馨欣，秀丽，秀美，秀逸，秀雅，秀华，秀兰，秀颖，秀隽，秀曼，秀媛，秀筠，秀慧，秀媚，秀婉，秀艾，秀敏，"
			+ "秀英，秀越，秀竹，秀妮，秀洁，秀艳，璇玑，璇子，璇珠，雪枫，雪卉，雪曼，雪萍，雪晴，寻春，寻绿，寻芳，英媛，盈秀，迎秋，"
			
			+ "莹玉，莹华，莹琇，颖慧，颖馨，颖然，颖秀，颖初，映波，映寒，映秋，幼仪，幼怡，幼安，雨筠，雨竹，语燕，语心，语诗，悦欣，"
			+ "悦可，雅宁，雅琴，雅容，雅柔，雅蕊，雅彤，雅韵，雅娴，雅懿，雅静，雅洁，雅丽，雅惠，雅韶，雅素，雅爱，雅美，雅云，雅媚，"
			+ "雅艳，雅可，艳丽，艳芳，艳娇，艳蕊，艳卉，依白，依然，依波，依秋，依美，依云，逸云，逸美，逸馨，倚云，怡然，怡宁，以晴，"
			+ "以蕊，以彤，以轩，忆梅，忆秋，忆彤，忆雪，英华，英秀，悦欣，悦心，悦爱，云梦，云水，云霞，云露，云英，云岚，云逸，云臻，"
			+ "云韶，云飞，云蔚，云亭，蕴秀，蕴美，韵诗、家颖，子义，青秋，玲凌，芸雅，津媛，若彤，以亦，雁玉，彤萱，抒迪，语霄、虞姿，"
			+ "丛菲，绿真，宸宁，宇芯，鸣荣，仙缦，聪歆，思甄，琦涵，甜杏，亦枝、远蓉，彦丹，含甜，傲茵，豆普，翠幻，奕凤，宣洢，海瑶，"
			+ "艺昕，奕歆，艺歆、敏蕾，冰翠，南文，访枫，小霜，宝萱，棋思，盼娇，娜玲，纹松，榆白，馨葵、明梦，琪钰，虞楠，歆微，琴熙，"
			+ "滢钰，婉玉，迪静，乐涵，莺妹，芝语，岚甜、佳琦，娜璐，悦蓝，书嘉，翔柳，燕红，卓尔，宸欣，趣书，涵芍，妍彦，玲雁、惠宁，"
			+ "慕荷，芍痴，雪菱，旋妮，霜芹，佳妮，芬彤，新绮，熙华，雯依，佳宁、珊漫，云曦，丽扬，云蝶，莺安，雪菱，雅颖，若敏，晶珊，"
			+ "夜白，半雪，佳涵、佩妤，松妍，佳宁，雯安，梦颖，琼涵，子文，凌娇，畅慕，含玉，觅风，雪华、松妍，琪依，雯珊，涵荷，菡琦，"
			
			+ "佳涵，奕雯，菡南，钰桐，玫茗，梦梦，如盈、诗嘉，听素，玲梨，江奇，樱缦，凝舞，芷菡，诗滢，虞荷，滢滢，诗莉，诗烟、佳晔，"
			+ "思琦，佩妤，璐瑶，敏蕾，雯梦，子义，琼瑶，晴芙，含卉，雪萍，雯珊、韵虹，雅蕊，新蕾，旭芩，铭忻，芹谷，姝江，秋华，晨暮，"
			+ "灵竹，谷雪，灵薇、芳蓓，佩瑜，诗嘉，灵倩，梓菁，锦清，沛玲，诗滢，千璐，舞黛，熙瑜，铃霞、晨静，嘉鑫，扬茜，琼涵，晓懿，"
			+ "玲凌，柏珊，艺歆，乐瑶，曼柔，琼忻，丹梦、曼云，珩雁，微蕊，玉芸，盈婷，嘉璐，扬茜，夏蓉，桃丽，冷安，山柳，娅瑶、云露，"
			+ "羿芯，菀妍，玥暮，凤谣，慕荷，禹彤，超真，夏晓，邑绿，娇茵，思芳、亭清，漫嘉，熙娟，妶文，叶好，梦缦，韵冰，焓暄，忆舒，"
			+ "景焓，诗姝，娜璐、婷玉，雪馨，莺宛，洁幽，芍痴，翔柳，晓懿，云菲，艺如，奕雯，艺馨，姝晶、美瑛，奕然，宣露，奕可，妍彤，"
			+ "丛菲，雪妮，晴琪，静曼，岚盈，祺玥，熙白、星文，伊丹，娅瑶，薇岚，雯珊，奕然，璟雯，靖彩，冰昕，眉赫，微芬，薰柳、雅欣，"
			+ "舞梓，卿茵，昕丽，碧熙，诗玲，雅菲，烟靖，熙诗，琦榆，滢煜，滢微、梦颖，千沐，丽娜，婧靖，菲瑶，丽明，自怡，夏菡，翌婷，"
			+ "歆诺，瑞霞，霜芹、舒馨，恨天，绮彤，芸伶，耘蓉，燕红，熙瑛，熙琪，琪微，熙钰，琪煜，琦煜、凌翠，丹丹，虞春，含雁，格菲，"
			+ "月倩，月灵，芊梦，昕紫，菡恩，慧睿，玉琦、芸梦，宸岚，倩熙，依皙，琦秋，花萍，紫霜，玉儿，云露，晓兰，巧春，傲冬、山彤，"
			
			+ "丝萝，访风，梅风，莞尔，觅波，萍音，玫茗，漫桃，珉柔，鹤瑜，宛菡、冰枫，映雪，曼梅，新颖，珊悦，云兰"; */
}

